resume.org
#+TITLE: Evan James McCarter's Resume
* Contact information
  - [[mailto:Evan.McCarter@gmail.com][Evan.McCarter@gmail.com]]: Email
  - [[tel:4438407034][4438407034]]: Main phone
  - [[tel:4439494381][4439494381]]: Cell phone
* Technical Skills
** Programming Languages
   - C++
   - Bash shell
   - Javascript
   - Java
   - PHP
   - SQL
   - Assembly
   - Windows Batch
   - Lisp
   - Perl
** Platforms, Tools, Technology
   - GNU+Linux
   - Git
   - Kafka
   - Hadoop
   - Accumulo
   - Zookeeper
   - AngularJS
   - Jquery
   - Bootstrap
   - Node.js
   - ExpressJS
   - Org-mode
   - HTML
   - CSS
   - MySQL
   - Weka
   - Lambda Calculus
** Prefer not to work with, but experienced
   - Python: whitespace has semantic value
   - Windows: unfree & secret standards constantly changing
* Employment
  - Software Engineer Intern at BrainTrust Holdings, LLC, June 2019 - August 2019
    - Developed software to rank document relevance by generating text from images, speech audio, video
    - Developed full stack application utilizing Microsoft Linux DSVM instances
    - Utilized technology such as Accumulo, Hadoop, Kafka, Zookeeper, Node.js, AngularJS, Spark
    - Collected analytics by passing data to various Microsoft cognitive services
    - Managed software installation: Automated downloading, decompression, configuration editing, setup of Zookeeper, Kafka, Hadoop, Accumulo
    - Created dynamic web UI using HTML, CSS, Javascript, AngularJS, Bootstrap, Node.js
    - Wrote Node.js server to fetch data from Accumulo database for web UI
    - Followed Scrum & Agile processes
    - Managed Git repository structure, handled creation and merger of branches
    - Implemented Apache Kafka to stream JSON files between modular and object oriented components
  - Circulation II at Baltimore County Public Library, July 2016 - present
* Relevant Projects
  - Bash shell utilities (Bash shell)
    - Find functions in source code without header comments (sed)
    - Find user’s SSH login information based on their name using key-value search (awk)
    - Easily and deterministically hash entire directories to detect changes (find, xargs)
    - Find disk locations with free space (df, sed, awk, lists in shell variables)
  - Taxi company simulator (C)
    - Simulated taxis picking up accumulating customers and delivering them to random destinations
    - Used structs, malloc, cohesive functions
  - Decentralized encrypted forum (Javascript, HTML, Node.js, CryptoJS)
    - Stored user-generated messages into a Decentralized Acyclic Graph tree stored on IPFS
    - IPFS is the InterPlanetary File System, software to share files peer-to-peer even when network size is limited
    - Messages are packaged into blocks that referenced a set of messages and a set of previous blocks. This forms a tree which can be used by clients to download messages referenced in blocks and discover further blocks
    - Blocks and messages are JSON objects, holding text or references to other files
    - Media was optionally encrypted and stored as base32 text, partitioned to meet plaintext size ceiling, and reassembled by the client while loading the message
  - Assigning trust ratings to friends-of-friends using Markov chains and bitcoin transaction data (PHP, HTML)
    - Used linear algebra to calculate how closely groups of people (Bitcoin addresses) interact
    - Took negative opinion into account by reducing trust weights, potentially until negative
  - Bitcoin crowdfunding site (PHP, SQL, HTML)
    - Used PHP pages, SQL database, and Blockchain.info wallets to track funds donated and trigger payout
    - PHP pages enabled creating new campaigns and displaying campaign statuses
* Education
  - University of Maryland, Baltimore County (UMBC), Jan 2017 - present
    - Anticipated graduation date January 2020: Bachelor degree in computer science
    - 3.554/4 GPA, 3.9/4 in-major GPA
  - Associate degree in computer science from Community College of Baltimore County (CCBC), Jan 2014 - Jan 2017. 3.41/4 GPA
* Relevant Coursework
  - Principles of Computer Security
  - Parallel & Distributed Processing
  - Cryptology
  - Database Management Systems
  - Design & Analysis of Algorithms
  - Principles of Operating Systems
  - Data Structures
  - Computer Architecture
  - Principles of Programming Languages
  - Computer Organization and Assembly Language Programming
  - C++ Programming
  - Logic and Object Oriented Design
* Awards
  - President’s list Fall 2017 (4.0/4 GPA & 12 credits)
  - Dean’s list Spring 2018, Fall 2016, Fall 2015 (3.75/4 GPA & 12 credits)
* Hobbies
  - Independent software engineering
  - Independent personal finance, philosophical, scientific study
  - Video games
    - Team Fortress 2
    - Fistful of Frags
    - Counter Strike: Source
    - Rimworld
