resume.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Evan James McCarter's Resume</title>
<!-- 2019-10-23 Wed 15:40 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Evan James McCarter" />
</head>
<body>
<div id="content">
<h1 class="title">Evan James McCarter's Resume</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Contact information</a></li>
<li><a href="#sec-2">2. Technical Skills</a>
<ul>
<li><a href="#sec-2-1">2.1. Programming Languages</a></li>
<li><a href="#sec-2-2">2.2. Platforms, Tools, Technology</a></li>
<li><a href="#sec-2-3">2.3. Prefer not to work with, but experienced</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Employment</a></li>
<li><a href="#sec-4">4. Relevant Projects</a></li>
<li><a href="#sec-5">5. Education</a></li>
<li><a href="#sec-6">6. Relevant Coursework</a></li>
<li><a href="#sec-7">7. Awards</a></li>
<li><a href="#sec-8">8. Hobbies</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Contact information</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="mailto:Evan.McCarter@gmail.com">Evan.McCarter@gmail.com</a>: Email
</li>
<li><i>4438407034</i>: Main phone
</li>
<li><i>4439494381</i>: Cell phone
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Technical Skills</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Programming Languages</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>C++
</li>
<li>Bash shell
</li>
<li>Javascript
</li>
<li>Java
</li>
<li>PHP
</li>
<li>SQL
</li>
<li>Assembly
</li>
<li>Windows Batch
</li>
<li>Lisp
</li>
<li>Perl
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Platforms, Tools, Technology</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>GNU+Linux
</li>
<li>Git
</li>
<li>Kafka
</li>
<li>Hadoop
</li>
<li>Accumulo
</li>
<li>Zookeeper
</li>
<li>AngularJS
</li>
<li>Jquery
</li>
<li>Bootstrap
</li>
<li>Node.js
</li>
<li>ExpressJS
</li>
<li>Org-mode
</li>
<li>HTML
</li>
<li>CSS
</li>
<li>MySQL
</li>
<li>Weka
</li>
<li>Lambda Calculus
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Prefer not to work with, but experienced</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Python: whitespace has semantic value
</li>
<li>Windows: unfree &amp; secret standards constantly changing
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Employment</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Software Engineer Intern at BrainTrust Holdings, LLC, June 2019 - August 2019
<ul class="org-ul">
<li>Developed software to rank document relevance by generating text from images, speech audio, video
</li>
<li>Developed full stack application utilizing Microsoft Linux DSVM instances
</li>
<li>Utilized technology such as Accumulo, Hadoop, Kafka, Zookeeper, Node.js, AngularJS, Spark
</li>
<li>Collected analytics by passing data to various Microsoft cognitive services
</li>
<li>Managed software installation: Automated downloading, decompression, configuration editing, setup of Zookeeper, Kafka, Hadoop, Accumulo
</li>
<li>Created dynamic web UI using HTML, CSS, Javascript, AngularJS, Bootstrap, Node.js
</li>
<li>Wrote Node.js server to fetch data from Accumulo database for web UI
</li>
<li>Followed Scrum &amp; Agile processes
</li>
<li>Managed Git repository structure, handled creation and merger of branches
</li>
<li>Implemented Apache Kafka to stream JSON files between modular and object oriented components
</li>
</ul>
</li>
<li>Circulation II at Baltimore County Public Library, July 2016 - present
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Relevant Projects</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Bash shell utilities (Bash shell)
<ul class="org-ul">
<li>Find functions in source code without header comments (sed)
</li>
<li>Find user’s SSH login information based on their name using key-value search (awk)
</li>
<li>Easily and deterministically hash entire directories to detect changes (find, xargs)
</li>
<li>Find disk locations with free space (df, sed, awk, lists in shell variables)
</li>
</ul>
</li>
<li>Taxi company simulator (C)
<ul class="org-ul">
<li>Simulated taxis picking up accumulating customers and delivering them to random destinations
</li>
<li>Used structs, malloc, cohesive functions
</li>
</ul>
</li>
<li>Decentralized encrypted forum (Javascript, HTML, Node.js, CryptoJS)
<ul class="org-ul">
<li>Stored user-generated messages into a Decentralized Acyclic Graph tree stored on IPFS
</li>
<li>IPFS is the InterPlanetary File System, software to share files peer-to-peer even when network size is limited
</li>
<li>Messages are packaged into blocks that referenced a set of messages and a set of previous blocks. This forms a tree which can be used by clients to download messages referenced in blocks and discover further blocks
</li>
<li>Blocks and messages are JSON objects, holding text or references to other files
</li>
<li>Media was optionally encrypted and stored as base32 text, partitioned to meet plaintext size ceiling, and reassembled by the client while loading the message
</li>
</ul>
</li>
<li>Assigning trust ratings to friends-of-friends using Markov chains and bitcoin transaction data (PHP, HTML)
<ul class="org-ul">
<li>Used linear algebra to calculate how closely groups of people (Bitcoin addresses) interact
</li>
<li>Took negative opinion into account by reducing trust weights, potentially until negative
</li>
</ul>
</li>
<li>Bitcoin crowdfunding site (PHP, SQL, HTML)
<ul class="org-ul">
<li>Used PHP pages, SQL database, and Blockchain.info wallets to track funds donated and trigger payout
</li>
<li>PHP pages enabled creating new campaigns and displaying campaign statuses
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Education</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>University of Maryland, Baltimore County (UMBC), Jan 2017 - present
<ul class="org-ul">
<li>Anticipated graduation date January 2020: Bachelor degree in computer science
</li>
<li>3.554/4 GPA, 3.9/4 in-major GPA
</li>
</ul>
</li>
<li>Associate degree in computer science from Community College of Baltimore County (CCBC), Jan 2014 - Jan 2017. 3.41/4 GPA
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Relevant Coursework</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Principles of Computer Security
</li>
<li>Parallel &amp; Distributed Processing
</li>
<li>Cryptology
</li>
<li>Database Management Systems
</li>
<li>Design &amp; Analysis of Algorithms
</li>
<li>Principles of Operating Systems
</li>
<li>Data Structures
</li>
<li>Computer Architecture
</li>
<li>Principles of Programming Languages
</li>
<li>Computer Organization and Assembly Language Programming
</li>
<li>C++ Programming
</li>
<li>Logic and Object Oriented Design
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Awards</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>President’s list Fall 2017 (4.0/4 GPA &amp; 12 credits)
</li>
<li>Dean’s list Spring 2018, Fall 2016, Fall 2015 (3.75/4 GPA &amp; 12 credits)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Hobbies</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>Independent software engineering
</li>
<li>Independent personal finance, philosophical, scientific study
</li>
<li>Video games
<ul class="org-ul">
<li>Team Fortress 2
</li>
<li>Fistful of Frags
</li>
<li>Counter Strike: Source
</li>
<li>Rimworld
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Evan James McCarter</p>
<p class="date">Created: 2019-10-23 Wed 15:40</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
